Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.BuiltInCategory},System.Boolean)
Constructs a new instance of a filter to match elements by built-in category, with the option to match all elements which are not of the given category.
categories:
The built-in categories to match.
inverted:
True if the filter should match all elements which are not of the given built-in categories.

Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.BuiltInCategory})
Constructs a new instance of a filter to match elements by built-in category.
categories:
The built-in categories to match.

Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},System.Boolean)
Constructs a new instance of a filter to find elements whose category matches any of a given set of categories, with the option to match all elements which are of the given categories.
categoryIds:
The category ids to match.
inverted:
True if the filter should match all elements which are not of the given categories.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more categories was not valid for filtering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementMulticategoryFilter.#ctor(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Constructs a new instance of a filter to find elements whose category matches any of a given set of categories.
categoryIds:
The category ids to match.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more categories was not valid for filtering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012